[["Filesystem interfaces and data structures.", "", "Current working directory related interfaces are provided in &.process.", "", "[ Elements ]", "/root/", "\tThe &Path to the root directory of the operating system.", "/null/", "\tThe &Path to the file that has no content and will discard writes.", "/empty/", "\tThe &Path to the directory that contains no files.", "/type_codes/", "\tSingle character representations for file types.", "\tPrimarily used by &Path.fs_require."], ["Exception raised by &Path.fs_require when requirements are not met.", "", "[ Properties ]", "/r_violation/", "\tThe subtype declaring the kind of violation that occurred.", "\t/`'void'`/", "\t\tFile did not exist.", "\t/`'inaccessible'`/", "\t\tPath traversed through a non-directory file,", "\t\tor had insufficient permissions on the leading path.", "\t/`'type'`/", "\t\tThe &r_type did not match the &fs_type.", "\t/`'directory'`/", "\t\tThe file identified by the path is a directory.", "\t/`'prohibited'`/", "\t\tThe required permissions stated in &r_properties", "\t\twere not available to the process.", "/r_type/", "\tThe required type issued to &Path.fs_require.", "/r_properties/", "\tThe required properties issued to &Path.fs_require.", "/fs_type/", "\tThe type of the file identified by &fs_path.", "/fs_path/", "\tThe path to the subject file."], ["File status interface providing symbolic names for the data packed in", "the system's status record, &system.", "", "[ Engineering ]", "Experimental. Helps isolate delayed imports.", "Likely undesired noise if a stat-cache is employed by &Path."], ["The status record produced by the system (&os.stat)."], ["The name of the file."], ["Number of bytes contained by the file."], ["/`'void'`/", "\tA broken link or nonexistent file.", "/`'directory'`/", "\tA file containing other files.", "/`'data'`/", "\tA regular file containing bytes.", "/`'pipe'`/", "\tA named pipe; also known as a FIFO.", "/`'socket'`/", "\tA unix domain socket.", "/`'device'`/", "\tA character or block device file.", "/`'link'`/", "\tStatus record of a link to a file."], ["For POSIX-type systems, designates the kind of (id)`device`:", "(id)`block` or (id)`character`.", "", "&None for status instances whose &type is not (id)`device`."], ["Time of creation; UTC. Not available on all systems."], ["Time of last modification; UTC."], ["Time of last access; UTC."], ["Time of last status change; UTC."], ["Whether the data file is considered executable by anyone.", "", "Extended attributes are not checked."], ["Whether the directory file is considered searchable by anyone.", "", "Extended attributes are not checked."], ["- &..route.abstract.Path", "- &..route.abstract.File", "", "Path implementation providing file system controls.", "&.files.root is provided for convenience, and &.process.fs_pwd is", "available for getting the working directory of the process."], ["Construct a &Path instance from the given absolute or relative path", "provided for &string; if a relative path is specified, it will", "be relative to the current working directory as identified by", "&os.getcwd.", "", "This is usually the most appropriate way to instantiate a &Path route", "from user input. The exception being cases where the current working", "directory is *not* the relevant context."], ["Return a new Route pointing to the file referenced by &path;", "where path is a path relative to the &context &Path instance.", "", "This function does *not* refer to the current working directory", "returned by &os.getcwd; if this is desired, &from_path is the", "appropriate constructor to use."], ["Construct an absolute path while interpreting consecutive separators", "as distinct partitions."], ["Create a temporary directory at a new route using a context manager.", "", "A &Path to the temporary directory is returned on entrance,", "and that same path is destroyed on exit.", "", "[ Engineering ]", "The use of specific temporary files is avoided as they have inconsistent", "behavior on some platforms."], ["Returns the full filesystem path designated by the route."], ["Returns the full filesystem path designated by the route as a &bytes object", "returned by encoding the &fullpath in &sys.getfilesystemencoding with", "`'surrogateescape'` as the error mode."], ["Construct a string path using &self as the prefix and appending the path", "fragments from &parts.", "", "Segment instances should be given with an asterisk applied to the argument."], ["Filesystem specific alias for &identifier."], ["Return the last dot-extension of the filename.", "&None if the filename has no `.` characters at all."], ["Modify the name of the file adding the given suffix.", "", "Returns a new &Path Route."], ["Modify the name of the file adding the given prefix.", "", "Returns a new &Path Route."], ["The type of file the route points to. Transforms the result of an &os.stat", "call into a string describing the (python/attribute)`st_mode` field.", "", "[ Returns ]", "- `'directory'`", "- `'data'`", "- `'pipe'`", "- `'socket'`", "- `'device'`", "- `'void'`", "", "If no file is present at the path or a broken link is present, `'void'` will be returned."], ["Whether the file at the route is considered to be an executable."], ["Generate &Path instances identifying the files held by the directory, &self.", "By default, all file types are included, but if the &type parameter is given,", "only files of that type are returned.", "", "If &self is not a directory or cannot be searched, an empty iterator is returned."], ["Retrieve the list of files contained by the directory referred to by &self.", "Returns a pair, the sequence of directories and the sequence of data files.", "", "Sockets, pipes, devices, and other non-data files are not retained in the list."], ["Generate pairs of directories associated with their files.", "", "Sockets, pipes, devices, broken links, and other non-data files are not retained in the lists."], ["Identify the set of files that have been modified", "since the given point in time.", "", "The resulting iterable does not include directories.", "", "[ Parameters ]", "", "/since/", "\tThe point in time after which files and directories will be identified", "\tas being modified and returned inside the result set."], ["Query the filesystem and return whether or not the file exists.", "", "A Route to a symbolic link *will* return &False if the target does not exist."], ["Update the modification time of the file identified by &self."], ["Return the size of the file as depicted by &os.stat."], ["Return the modification time of the file."], ["Set the modification time of the file identified by the &Route."], ["Retrieve the entire contents of the file as a &str."], ["Modify the regular file identified by &self to contain the given &string."], ["Return file specific meta data.", "", "! WARNING:", "\tPreliminary API."], ["Create and initialize a data file at the route using the given &data.", "", "If &data is &None, no write operation will occur for pre-existing files.", "If &data is not &None, the bytes will be written regardless.", "", "Returns the route instance, &self.", "Leading directories will be created as needed."], ["Open the file pointed to by the route.", "", "If the file doesn't exist, create it; if the directories", "leading up to the file don't exist, create the directories too."]]