[["System argument vector interpretation methods.", "", "&legacy is the only implemented method and should cover most use cases.", "", "[ Events ]", "", "/`mismatch-unrecognized`/", "\tThe signalled option did not appear in either index.", "/`mismatch-parameter-restricted`/", "\tThe long option was given a parameter, but the option takes none.", "/`mismatch-parameter-required`/", "\tThe option requires a parameter, but no argument was provided.", "\tEither due to end of fields or explicit termination.", "/`sequence-append`/", "\tAppend the option's arguments to the slots.", "/`set-add`/", "\tAdd the option's argument to the set identified by the slot.", "/`field-replace`/", "\tAssign the option's argument to the field identified by the slot.", "/`integer-add`/", "\tAdd a positive or negative integer to the field identified by the slot.", "/`subfield-replace`/", "\tUsing the mapping identified by the slot, assign the key and value extracted", "\tfrom the argument.", "/`sequence-append-assignment`/", "\tUsing the sequence identified by the slot, append the tuple representing", "\tassignment provided as the argument to the option."], ["Exception signalling that options were not properly expressed.", "", "[ Properties ]", "/mismatch/", "\t/`'mismatch-unrecognized'`/", "\t\tThe option could not be mapped to an action and configuration slot.", "\t/`'mismatch-parameter-required'`/", "\t\tThe option required a parameter and the argument vector had no more elements.", "\t/`'mismatch-parameter-restricted'`/", "\t\tThe option was given an argument, but takes zero.", "/origin/", "\tThe location of the option as cited by the mismatch event.", "/option/", "\tThe identified option being processed.", "/argument/", "\tThe option's identified argument if any."], ["Interpret an argument vector, &options, according to the &restricted", "and &required option indexes. Identified signals are translated into", "events describing the expected operation, target slot, and value to be", "processed by a configuration context.", "", "The produced events are terminated by a `'remainder'` event containing", "the excess fields that could not be translated. If all fields were processed", "as options, the remainder will be an empty list.", "", "In the case of an error, the event prior to the remainder will be identified", "as a mismatch operation with the slot identifying the option that failed", "to match an index entry.", "", "[ Parameters ]", "/restricted/", "\tMapping designating the options that take no parameters.", "/required/", "\tMapping designating the options that require one or more parameters.", "/options/", "\tThe argument vector to interpret.", "/trap/", "\tOptional slot identifier used when an unrecognized long option", "\tis processed. Produces `sequence-append` events.", "/offset/", "\tDefaults to zero; designates the offset to apply to field indexes", "\tin order to properly mention a flag or parameter's location.", "/signal/", "\tDefaults to `-`; the character used to identify options in the vector.", "/assignment/", "\tDefaults to `=`; the character used to separate a long option's name", "\tfrom its argument."], ["Apply the values provided by &events into &target using", "the event's operation to select the merge method provided in &Operations.", "", "[ Parameters ]", "/target/", "\tThe object that the interpreted options and arguments are being", "\tinserted into. A configuration dictionary.", "/events/", "\tAn iterable producing recognized option events.", "\tNormally, constructed by &legacy.", "/Interpreter/", "\tA function called with the slot being assigned and value that needs", "\tto be interpreted prior to the storage operation.", "", "\tDefaults to a reflection of the given value(no-op).", "/Operations/", "\tA mapping designating how an assignment operation is to be", "\tperformed against the &target.", "", "\tDefaults to &operations."]]