[["Parse, Serialize, and Tokenize Resource Indicators", "", "&.ri provides tools for working with standard IRIs or URIs. However,", "it is not strict. It does not require exact formatting for a parse", "operation to succeed; rather, the validation of the output is left", "to the user.", "", "The module refers to IRI and URI strings as Resource Indicators.", "The distinction is made as the module deals with a slight generalization", "where constraints are not enforced or checked.", "", "[ Entry Points ]", "- &parse", "- &serialize", "- &tokens", "", "[ Types ]", "", "A parsed indicator is designated a type. The set of possible types", "is inspired by the URI and IRI standards:", "", "/authority/", "\tAn authority indicator identified by the presence of (characters)`'://'`", "\tfollowing the scheme field.", "/absolute/", "\tA colon following the scheme field.", "/relative/", "\tA pair of slashes following the scheme field. Often, the scheme", "\tis implied in these cases.", "/amorphous/", "\tThe absence of characters that allow the unambiguous identification", "\tof a type. Usually indicates a value error."], ["Enable strict serializations.", "When performed on a cached import, this will effect the entire process.", "", "In order to isolate the effect to a certain part of the process, the module should", "be created from the loader and &strict should be called relative to the local copy."], ["Split an IRI into its base components based on the markers:", "", "\t(: | ://), /, ?, #", "", "Returns the top-level parts of the IRI as a namedtuple.", "", "[ Parameters ]", "/iri", "\tA complete IRI or URI."], ["Join a list of paths(strings) on \"/\" *after* escaping them."], ["Return a list of unescaped strings split on \"/\".", "", "Set `fieldproc` to `str` if the components' percent escapes should not be", "decoded."], ["Make an RI from a split RI(5-tuple)"], ["Recognize IPv4 hosts as addresses."], ["Split a network location into a 4-tuple, (user, password, host, port).", "", "Set `fieldproc` to `str` if the components' percent escapes should not be", "decoded."], ["Create a netloc fragment from the given tuple(user, password, host, address, port)."], ["Create a dictionary from a split RI(5-tuple).", "", "Set `fieldproc` to `str` if the components' percent escapes should not be", "decoded."], ["Given a sequence of (key, value) pairs, construct."], ["Construct a RI tuple(5-tuple) from a dictionary object."], ["Parse an RI into a dictionary object. Synonym for `structure(split(x))`.", "", "Set `fieldproc` to `str` if the components' percent escapes should not be", "decoded."], ["Return an RI from a dictionary object. Synonym for `join(construct(x))`."], ["Return the HTTP Request-URI suitable for submission with an HTTP request."], [" Format the authority fields of a Resource Indicator."], ["Construct an iterator producing Resource Indicator Tokens.", "The items are pairs providing the type and the exact text", "to be used to reconstruct the Resource Indicator parsed", "into the given &struct."]]