[["Client and server common IETF HTTP tools for &..kernel based applications.", "", "[ Properties ]", "/HeaderSequence/", "\tType annotation for the header sequence used by &Structures instances."], ["Generator producing the integer ranges specified by the given Range header.", "", "[ Parameters ]", "/length/", "\tThe (http/header)`Content-Length` of the entity body being referenced.", "/range_header/", "\tThe (http/header)`Range` to be converted to slices."], ["Manages a sequence of HTTP headers and cached access to specific ones.", "", "Primarily used to extract information from received response (client) or request (server)."], ["Create a cache for a sequence of headers directly stored.", "", "[ Parameters ]", "/headers/", "\tThe sequence of pairs designating the storage area to use.", "/local/", "\tAdditional headers that should have cached access."], ["Configure the structure as representing a request received by a server."], ["Configure the structure as representing a response received by a client."], ["Whether the response is a redirect."], ["Set the headers to be cached and structured for use by an application."], ["The sequence of path items in pathstring."], ["The query parameters of the URI."], ["Whether or not the request looking to perform protocol substitution."], ["Whether the headers indicate an associated body."], ["The length of the content; positive if exact, &None if no content, and -1 if arbitrary.", "For HTTP, arbitrary triggers chunked transfer encoding."], ["The byte ranges of the request."], ["The (http/header-id)`Upgrade-Insecure-Requests` header as a boolean.", "&None if not the header was not present, &True if the header value was", "(octets)`1` and &False if (octets)`0`."], ["Return the connection header stripped and lowered or `b''` if no header present."], ["Cached access to a media range header."], ["Structured form of the Accept header."], ["The structured media type extracted from the (http/header-id)`Content-Type` header."], ["Date header timestamp."], ["Decoded host header."], ["Character encoding of entity content. &None if not applicable."], ["Whether this is suppoed to be the last transaction in the connection."], ["Join flow events into a proper HTTP stream."], ["Generator that can be used to communicate whether or not", "the response will have a body. Used with client disposition."], ["Split an HTTP stream into flow events for use by &flows.Division."], ["Protocol class sending HTTP messages."], ["Used by clients to select the proper initiation to send."], ["Used by servers to select the proper initiation to send."], ["Protocol class receiving HTTP messages."], ["For use by server receiving the client request."], ["For use by clients receiving the server response."]]