[["Project materialization tools for instantiating polynomial-1 organized factor sets."], ["factors/polynomial-1 .format serialization"], ["The core data for composing a factor.", "", "[ Properties ]", "/type/", "\tThe factor type.", "/requirements/", "\tSet of factor references needed for integration.", "/sources/", "\tA sequence of pairs defining the source name and the source content.", "", "\tFor polynomial-1, the source name is the extension that will be appended to", "\tfactor path if sources is a &Cell instance."], ["Define an indirectly typed factor's composition.", "", "[ Parameters ]", "/extension/", "\tThe dot extension that will be appended to the file to identify its type.", "/source/", "\tThe data or reference to the data that will be used to initialize the file.", "/type/", "\tAn optional factor type string. This is ignored by &plan as this is composing", "\tan indirectly typed factor."], ["Define an explicitly typed factor's composition.", "", "Equivalent to the default constructor with the exception that &requirements", "and &sources are copied into a new list.", "", "[ Parameters ]", "/type/", "\tThe type to be assigned to the factor.", "/requirements/", "\tThe set of factors needed for integration.", "/sources/", "\tThe iterable producing pairs defining the relative paths and sources."], ["The necessary data for instantiating a project on the local system.", "", "[ Properties ]", "/information/", "\tThe &types.Information instance defining the project's identity.", "/formats/", "\tThe source formats identified by the project.", "/factors/", "\tThe set of factors that make up a project; a sequence of factor path-composition pairs.", "/extensions/", "\tAdditional project information."], ["Create a parameter set for project instantiation applying the proper types", "to factor entries, and translating factor types to file extensions for defining", "&soles.", "", "[ Parameters ]", "/information/", "\tThe project's identification.", "/formats/", "\tThe project's source formats.", "/soles/", "\tA sequence of records defining single source factors that should be", "\tpresented at a path consistent with the factor path.", "/sets/", "\tA sequence of records defining factors with multiple sources.", "/icon/", "\tAn IRI identifying the image representing the project.", "\tThis includes `data` scheme IRIs.", "/synopsis/", "\tA short string describing the project."], ["Generate the filesystem paths paired with the data that should be placed", "into that file relative to the project directory being materialized."], ["Create a Project instance using the filesystem API's provided by &route", "from the instructions produced by the given &plans.", "", "! WARNING:", "\tPlan entries referring to files will cause the file content to be loaded entirely into memory.", "\tInstantiating projects with large resources may require a side channel in order to achieve", "\treasonable memory usage.", "", "[ Parameters ]", "/route/", "\tA, usually filesystem, route to the directory that plan", "\tsegments will extend into.", "/plans/", "\tAn iterable of pairs where the first item is the segment, relative path,", "\tand the second is either the data to be stored or a &files.Path instance", "\treferring to the data to be stored."], ["Materialize the plan of the given &project using the &route as the root directory of the project.", "", "[ Parameters ]", "/project/", "\tThe set of parameters needed to plan and materialize a project.", "/route/", "\tA route to the root target directory.", "/dimensions/", "\tAn optional sequence of strings that will be appended to the project's identifier."]]