[["Collection of data structures and functions for working with exact addresses in (syntax) text files."], ["A Line Number and Column address used to identify a position in a syntax file.", "Line numbers and columns are 1-based. There is no Line Zero and no column zero", "with exception to Addresses used in &rangetypes.IRange instances.", "", "Address values must be constructed with one special condition:", "if the address is being used in a range where the last character of the line", "is being selected as the stop in the range,", "the instance must be created to refer to the following line and the zero-column.", "This special case is used to allow inclusive ranges to properly detect continuity."], ["The line number identified by the address.", "", "When the column number is zero, the internal value is adjusted under the", "presumption that the address was referring to the end of the previos line."], ["The column number identified by the address. &None if the address", "is referring to the end of the &line."], ["Adjust a stop &Address' pointers for use in an &Area so that it can", "be recognized as reference to the final character in a line.", "", "If the given address points to the final position in the line, the line", "number will be incremented and its column set to zero. This allows", "&rangetypes.Set to detect continuity when working with &Area instances."], ["Whether the address refers to an imaginary location. An imaginary line is", "identified using `0` as addresses use `1` based indexes.", "", "Often, imaginary locations can be considered invalid by a given context, but when", "employed by AST nodes or stack traces, line zero can be used to refer to injected nodes", "that do not exist in the original Syntax Document. The column index of imaginary lines", "should be used to refer to meta data about the injection."], ["Inclsuive Range of &Address instances. Usable with &rangetypes.Set and", "&rangetypes.Mapping instances."], ["Whether the Area refers to a purely vertically area of the syntax without", "constraints on the columns.", "", "Zero-column references *must* be used to identify an Area as purely vertical."], ["Whether the area refers a purely horizontal area of the syntax within a single line.", "", "Zero-column references to the end of the line are not permitted to be used for", "pure horizontal Areas. The inherited limitation being that some continuity realizations", "requires additional contextual knowledge (line length)."], ["Construct an &Area from the given indexes normalizing the stop address."], ["Construct an &Area from the given string."], ["Construct an &Area from the inclusive line indexes in &pair.", "The returned instance guarantees &vertical."], ["Retrieve the prefix, suffix, and selected lines that are delieanted by the &Area, &self."]]