[["Service configuration interfaces.", "", "Manages the service state stored on disk.", "", "[ Properties ]", "", "/environment/", "\tThe environment variable that will be referenced in order", "\tto identify the default service directory override.", "", "/default_route/", "\tA &Path instance pointing to the default route", "\trelative to the user's home directory. (~/.fault)"], ["Return the service directory route."], ["Collect the routes to the set of services in the directory.", "Regular files existing in &route are ignored."], ["Service configuration storage interface."], ["Whether the service's configuration directory exists."], ["Create the service directory."], ["Destroy the service directory."], ["Overwrite configuration fields present in the given mapping, &fm.", "No merge logic is applied; the value in the mapping will replace the attribute value."], ["Initialize the Service structure selecting the &route as its", "storage location. The &route may not exist upon instantiation", "as it may be the first use in which the user may choose to", "initialize a directory or merely check for whether it is", "a service at all."], ["Trim the critical log in the service's directory.", "", "! PENDING:", "\tNot implemented."], ["Return a tuple consisting of the executable and the parameters."], ["Execute the service replacing the process image. &execute does not return.", "", "Environment variables will be updated by the running process,", "the current working directory will be switched to service's directory,", "&route, and the service with be executed according to the current", "working settings assigned to &self.", "", "A call to &load prior to running this is often reasonable."], ["Create the service directory and initialize many of the configuration files."], ["Whether or not the service directory exists."], ["Whether the stored configuration has the necessary", "on-disk structure for supporting a rootd Service."], ["Load the service definition from the filesystem."], ["Store the service definition to the filesystem."]]