[["I/O Transaction Contexts for managing transfers and protocol transports.", "", "I/O is managed using three types: &Transfer, &Transport, and &Interface.", "&Transfer is the Transaction that manages the flows supporting a bidirectional or unidirecitonal", "stream."], ["Context managing a *single* sequence of &flows.Channel instances."], ["Connect a sequence of &flows.Channel instances to a new &flows.Terminal", "instance that signals the &Transfer when the Flow has completed.", "", "The &flows.Terminal created and dispatched will be returned and the &Transfer flow", "count will be incremented."], ["Signal the first &flows.Channel that it should begin performing transfers."], ["Explicitly terminate the managed flow."], ["Complete the termination of the transfer."], ["Dispatch processor for &Transport instances."], ["Update the router used to facilitate a protocol transaction."], ["Method enqueued by &f_transfer to flush the protocol transaction queue.", "Essentially, an internal method."], ["Accept a sequence of requests from a client configured remote endpoint.", "Routes the initiation parameter with callbacks to connect input and output.", "", "Used by routers employed by servers to get protocol transactions."], ["Received a set of responses. Join with requests, and", "execute the receiver provided by the enqueueing operation.", "", "Used by routers employed by clients to get the response of a protocol transaction."], ["Allocate a channel for submitting a request.", "", "Returns the channel identifier that will be used and the callback to submit the", "initiate parameter and upstream channel."], ["The Transaction Context that manages the stack of protocols", "used to facilitate arbitrary I/O streams."], ["Create and initialize an instance with the first transport layer."], ["Create and initialize an instance with using a stack."], ["Extend the transport stack with multiple intermediates.", "This method should only be used prior to &tp_connect."], ["Extend the transport stack with a single intermediate.", "This method should only be used prior to &tp_connect."], ["Connect the given mitre series, &mitre, to the configured transport stack.", "Usually called after dispatching an instance created with &from_stack."], ["Push the protocol channels on to the stack."], ["Called by a protocol stack entry when both sides of the state have been closed."], ["Close the outgoing transfer context."], ["Application context managing logical interfaces."], ["Given file descriptors, install a new set of flows", "accepting sockets from the given listening sockets."], ["Allocate and dispatch accept flows for the given &kports."], ["Application context managing accepted transports."], ["Moving to Sockets. Routing will be handled with flows."], ["Dispatch a set of a flows within the Transaction as connected Transfers."]]