[["Inline box rendering for replayable views of text content.", "", "&.frames provides functions for formatting framed text from &Content.", "&Content represents a sequence rows consisting of a single column;", "the placement of &str instances within the tuples contained by the", "sequence controls the alignment of the displayed text. A leading", "&None within the instance causes a horizontal separator to be drawn", "according to the selected box theme.", "", "[ Engineering ]", "", "Somewhat of a warning.", "Raw (integer) indexes are commonly used within this module; the \"themes\" are regular", "strings, &f_solid, and the indexes refer to the boundary character at that index within the theme.", "The included themes have identical character counts, but customized themes may have extensions", "in order to support transitions by &stitch."], ["Whether the character is a Unicode Box Drawing character."], ["Emit the formatted lines of a prepared sequence as &str instances.", "Newline characters are *not* added to line."], ["Create a new theme based on &theme applying rounded corners where specified in &corners.", "", "#!syntax/python", "\trdiagonal = round(f_solid, 'top-left', 'bottom-right')"], ["Calculate the sum of the lengths of each item in the sequence;", "excepting values starting with &None representing a division."], ["Build sequences of strings providing the necessary formatting for the display", "of the framed data.", "", "[ Parameters ]", "/theme/", "\tThe frame characters to use by default. Usually one of", "\t&f_ascii, &f_solid, &f_bold, &f_double.", "/width/", "\tThe span of the data to align on. Usually, the maximum length of", "\ta row calculated by `max(width(sequence))`.", "/sequence/", "\tAn iterable producing tuples of strings that will populate the", "\tdisplayed rows."], ["Vertically pad the two prepared images with empty records", "according to the describes &offsets.", "", "[ Parameters ]", "/left/", "\tThe frame that will be placed on the left side.", "/right/", "\tThe frame that will be placed on the right side.", "/offsets/", "\tThe pair of vertical offsets for the &left and &right designating", "\twhere their top will be placed. Defaults to zeros."], ["Calculate the combined border for the given characters according to the", "&theme, combination &mapping using the adjacent &borders."], ["Connects prepared frames along the vertical borders.", "", "Join two prepared frames so that intersections are properly combined.", "Both the left and right sides are modified in place respecting the boundaries.", "", "If the two prepared frames are not of equal length (rows), &align must be called", "on the two frames before being given to &stitch.", "", "[ Parameters ]", "/aligned/", "\tAn iterator of aligned pairs providing the left and right side", "\tto connect together into a combined image.", "", "\tMultiple pairs are accepted to stitch the vertical edges", "\tas well as the horizontal."]]