[["Terminal support for status displays."], ["Abstraction for legacy ANSI/DEC escapes."], ["Adjust cursor visibility."], ["Confine the scrolling region to the given rows."], ["Release confinements on scrolling region."], ["Set the scrolling region, enter it, and seek the bottom.", "Subsequent &exit_scrolling_region and &enter_scrolling_region", "should be use to maintain the SR's state."], ["Save the screen buffer, reset the scrolling region, and restore the buffer.", "This preserves the screen's state after the transition."], ["Enter scrolling region; normal terminal output; restores cursor location."], ["Exit scrolling region; allow out of region printing; saves cursor location."], ["Clear the staionary area according to its configured width and default text properties."], ["Erase the given area."], ["Primitive relative seek; Context cursor position is *not* updated."], ["Style the given &text as &name.", "", "Text color will be reset to the default."], ["Translate the color names to SGR codes."], ["Update the dimensions of the screen."], ["The set, sizes, and ordering of fields present in a monitor."], ["Generate a series of separators finished with a terminator.", "Given a number of a fields, emit separators until the final index", "is reached."], ["The display text for the field's label."], ["Iterate over the fields in their designated order along with separators", "that can be used to follow the rendered field."], ["Join the field identifier, cell allocation, and field label in", "the order designated by &order."], ["The rendering methods and parameters used by a &Status."], ["Renders the string form of &field with the style set identified", "by &key."], ["Render method expecting and returning a sequence of formatting pairs.", "", "Used in cases where the field wishes to control theme-relative", "formatting directly."], ["Render method for common duration fields."], ["Define the &style to use with the given &name."], ["Assign a render method, &call, for the &field."], ["Emit words formatted according to their associated style set."], ["Render the given &field according to the configured &type' render method."], ["Allocated area for status display of a set of changing fields."], ["Reset the metrics records using the given entry as the only one."], ["Update the time field on the last metrics record."], ["Update the metrics record for the given point in time."], ["Select the next read type for the given field using the &view_state_loop."], ["Attach a constant phrase to the beginning of the monitor."], ["Attach a constant phrase to the end of the monitor."], ["Assign the monitor's title and dimension identifiers."], ["Calculate the current metrics window size."], ["The monitor's image as a single phrase instance."], ["A bytes form of the &Status.phrase. (The image without cursor movement)"], ["Construct a triple containing the start and stop time and the final metrics."], ["Construct a status frame synopsis using the monitor's configuration and metrics."], ["Construct a transaction frame for reporting the status.", "Used after the completion of the dispatcher."], ["Terminal display management for monitoring changes in &Status instances."], ["Construct the string representation of the given &monitor' status."], ["Erase, reframe, and update the given monitor."], ["Render and emit the prefix, title, and suffix of the &monitor.", "", "Operation is buffered and must be flushed to be displayed."], ["Render and emit the given &fields.", "", "Operation is buffered and must be flushed to be displayed."], ["Write any buffered terminal changes to the device."], ["Clear the entire status regions."], ["Configure the scrolling region allocating &lines at", "the top or bottom of the screen for status display.", "", "This method should be called after window changes of any type.", "The window size is refreshed from the device; monitors should", "also be reallocated so that their Context positions can be adjusted."], ["Render method for counts providing compression using metric units."], ["Render method for monitor titles."], ["Construct a &Layout and &Theme from the provided order and formatting structures."], ["Use the first three file descriptors to determine the", "path to the tty device. If no path can be identified,", "return the given &path which defaults to `/dev/tty`."], ["Construct &Status instances allocated using &control for", "displaying the aggregate of the dimension allocations.", "", "Returns a sequence of &Status instances for the dimensions", "and a single Status for the aggregation."]]