[["Structures for supporting the calculations and representations of factor statistics."], ["Triple of integers representing a total product, subject factor, and integer count.", "Provides the core structure for the statistical elements used by &..metrics.", "", "The (vector) integers are represented using a triple as the vectors are analyzed from", "three different perspectives in order to collect the information provided by", "&Statistics.", "", "[ Properties ]", "/total/", "\tThe integer product calculated by multiplying &subject and &count.", "/subject/", "\tThe factor being multiplied by &count.", "\tOften, the subject is calculated or recalculated by dividing the", "\ttotal with the count. &rational should be used in order to obtain an", "\taccurate &subject value.", "/count/", "\tThe number of times &subject occurred in a vector.", "\tThe factor used to multiply &subject."], ["Construct an aggregate from a pair of vectors of totals and counts."], ["Sort key for frequency profiles."], ["Sort key for subject profiles."], ["The numerator of the average's fractional component.", "Where &count is the implied denominator."], ["Calculate the, true, &subject based on &total and &count."], ["Apply a sequence of distinct values to the product's &total.", "", "The &subject is re-calculated based on the new total."], ["Increment the &count and perform the corresponding adjustments to the &total.", "Given delta"], ["Common statistics regarding a set of values.", "", "[ Properties ]", "/total/", "\tSum of the ordering key.", "/edges/", "\tThe minimums and maximums of the value set."], ["The lowest value recorded in &edges."], ["The highest value recorded in &edges."], ["The difference between the maximum and the minimum."], ["Iterator selecting the minimum &Products retained by the profile."], ["Iterator selecting the maximum &Products retained by the profile."], ["&Profile set and measurements for calculating statistical properties of a vector.", "", "[ Properties ]", "/count/", "\tThe original unique number of elements that the profiles were built from.", "/deltas/", "\tSum of the distances from the average.", "\tFor distance measurement.", "/areas/", "\tSum of the areas, squares, from the average.", "\tFor standard deviation measurement.", "/frequency/", "\tProfile of the numbers organized by their frequencies.", "\tTotals the counts.", "/subjective/", "\tProfile of the numbers organized by their unique instances.", "\tTotals the subjects.", "/magnitude/", "\tProfile of the numbers organized by their total values.", "\tTotals the totals."], ["The &Product representing the mean of the values.", "Provides access to the total and count of values."]]